notes/cse/software-design-and-testing.org
#+TITLE: Software Design and Testing
#+DATE: [2025-06-25 Wed 09:00]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: TOC:2 num:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../assets/favicon.ico">

* Assesment

** Scrum Quiz: 24th July

** Written Test - closed book: 31st July

** Unit Testing PC based open book: 7th August

* Resources

** Extreme Programming Explained: Addison-Wesley

** Scrum and XP from the Trenches: Henrik Kniberg

** The Scrum Master Training Manual

** www.scrumtrainingseries.com

** scrummethodology.com

** scrum.org

* Definitions

** User Stories
   - Are requirements for the software

** Scrum, XP, Kanban

** Version Control

** Basic Unit Testing

** Testing
   - The result of software failures is a DAMAGED REPUTATION to self and the company
   - Testing objectives: Finding defects in the software, confirming that the system works, assessing the quality of the software, reducing maintenance costs (as a side effect)
   - Testing goal: To validate whether the test object (feature) works as expected by the users and other stakeholders

** Software
   - Computer programs and associated documentation such as requirements, design models and user manuals.
   - Be cautious of the defects
   - Cost: software is generally more expensive than hardware. Software engineering is concerned with cost-effective software development

** The Software Process
   - Activities: Specification, Development, Validation, Evolution

* Challenges Of Software
  - Complex Requirements
  - Compatibility Issues
  - Cost Estimation and Milestones

* Agile Methodology

** The Core
   - For Customers
   - For Development Teams
   - Overall Advantages

** Iterative
   - Plan
   - Design
   - Develop
   - Test
   - Deploy
   - Feedback

* User Stories

** Addressing the problem

*** Software Requirements
    - Software requirement is a communications problem
    - Those who want software must communicate with those who build it

*** One Side is Dominant
    - Neither side of the Business or Software devs should be dominant
      - Business dominant ex.: I need this, by this date, make it so
      - Software dev dominant ex.: Replacing the business language with tech jargon

