notes/cse/software-design-and-testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-30 Wed 09:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Design and Testing</title>
<meta name="author" content="Damian Chrzanowski" />
<meta name="generator" content="Org Mode" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/org.css"/>
<link rel="icon" href="../assets/favicon.ico">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Software Design and Testing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org923d1c7">1. Assesment</a>
<ul>
<li><a href="#org3f8cc86">1.1. Scrum Quiz: 24th July</a></li>
<li><a href="#org5969f6b">1.2. Written Test - closed book: 31st July</a></li>
<li><a href="#org9f56f50">1.3. Unit Testing PC based open book: 7th August</a></li>
</ul>
</li>
<li><a href="#orgb357594">2. Resources</a>
<ul>
<li><a href="#org3f0e5ce">2.1. Extreme Programming Explained: Addison-Wesley</a></li>
<li><a href="#org4752d37">2.2. Scrum and XP from the Trenches: Henrik Kniberg</a></li>
<li><a href="#org836e227">2.3. The Scrum Master Training Manual</a></li>
<li><a href="#org32b1d12">2.4. www.scrumtrainingseries.com</a></li>
<li><a href="#orgf16572a">2.5. scrummethodology.com</a></li>
<li><a href="#orgd6b6e62">2.6. scrum.org</a></li>
</ul>
</li>
<li><a href="#orgdd4bed1">3. Definitions</a>
<ul>
<li><a href="#org9610b9e">3.1. User Stories</a></li>
<li><a href="#orgfa2210f">3.2. Scrum, XP, Kanban</a></li>
<li><a href="#orgceb16cb">3.3. Version Control</a></li>
<li><a href="#org82787af">3.4. Basic Unit Testing</a></li>
<li><a href="#org1b882a1">3.5. Testing</a></li>
<li><a href="#org2d0e470">3.6. Software</a></li>
<li><a href="#orge3526fc">3.7. The Software Process</a></li>
</ul>
</li>
<li><a href="#org87d2b63">4. Challenges Of Software</a></li>
<li><a href="#org9784379">5. Agile Methodology</a>
<ul>
<li><a href="#orgee0f033">5.1. The Core</a></li>
<li><a href="#org6d8627f">5.2. Iterative</a></li>
</ul>
</li>
<li><a href="#orgd2d8f2f">6. User Stories</a>
<ul>
<li><a href="#org4472845">6.1. Addressing the problem</a></li>
<li><a href="#orgda9f54e">6.2. User Stories are a pointer to the requirement (in programmer's terms)</a></li>
<li><a href="#org8ee133e">6.3. The three C's (how user stories are usually created)</a></li>
<li><a href="#orgd234d11">6.4. Definition of User Story</a></li>
<li><a href="#org5469a4f">6.5. Example (note that importance of SO THAT)</a></li>
<li><a href="#orgacd7df4">6.6. User Story Types</a></li>
<li><a href="#org06b6095">6.7. Product Backlog</a></li>
<li><a href="#org0c75822">6.8. Story writing workshops</a></li>
<li><a href="#orgd98581d">6.9. Why User Stories?</a></li>
<li><a href="#orgec663b9">6.10. DON'T FORGET</a></li>
<li><a href="#org4f99a6f">6.11. INVEST</a></li>
</ul>
</li>
<li><a href="#org70e93bd">7. SCRUM</a>
<ul>
<li><a href="#orgf66ab67">7.1. Definition</a></li>
<li><a href="#org9df0b53">7.2. Scrum requires a Scrum Master to foster an environment where:</a></li>
<li><a href="#orge4fb372">7.3. Scrum is simple</a></li>
<li><a href="#org981f9ee">7.4. Scrum Theory</a></li>
<li><a href="#orga9b8b02">7.5. Pillars Of Scrum</a></li>
<li><a href="#org13c9d96">7.6. Scrum Values</a></li>
<li><a href="#org66a0c5e">7.7. Scrum Team</a></li>
<li><a href="#orgfdf28ac">7.8. Scrum Events</a></li>
<li><a href="#org86459cc">7.9. Scrum Artifacts</a></li>
</ul>
</li>
<li><a href="#org6871669">8. Revision Questions for Exam</a>
<ul>
<li><a href="#org8ca1e35">8.1. What is Software</a></li>
<li><a href="#orga5c97b1">8.2. What is Software Engineering</a></li>
<li><a href="#org143210a">8.3. Explain why we need to engineer software and not “just code it”.</a></li>
<li><a href="#orgec7a69a">8.4. What is a software process? Describe the common activities that are part of all software processes</a></li>
<li><a href="#orge5db388">8.5. What are the four important or essential attributes that all professional software should have? Suggest four other attributes that may sometimes be significant.</a></li>
<li><a href="#org42714a0">8.6. Compare Agile and Waterfall</a></li>
<li><a href="#org1a485cc">8.7. What are the characteristics of Agile projects?</a></li>
<li><a href="#orge18ab16">8.8. How is incremental different to iterative?</a></li>
<li><a href="#org61b12ee">8.9. List 2 advantages of the waterfall methodology</a></li>
<li><a href="#org6b13e0f">8.10. What is the scientific method underpinning Agile methods?</a></li>
<li><a href="#org2020edb">8.11. Describe the main activities common to all software processes</a></li>
<li><a href="#org56729f3">8.12. What is the software process model or software process description?</a></li>
<li><a href="#org9c45cf4">8.13. What is the main difference between plan-driven and agile processes?</a></li>
<li><a href="#org39e6c99">8.14. Describe the waterfall model in software development and discuss some of the inherent problems in the waterfall model</a></li>
<li><a href="#org1f609c2">8.15. Discuss advantages and disadvantages of story cards</a></li>
<li><a href="#orgc9a2aa4">8.16. What are the three parts of a user story. Give examples of a User Story Description. Describe how user story should follow the INVEST principle giving examples to support your answer.</a></li>
<li><a href="#org0d0cc4c">8.17. With respect to User Stories what is the definition of done. Give examples.</a></li>
<li><a href="#orgbbede28">8.18. Cone of uncertainty</a></li>
<li><a href="#org3402114">8.19. What are “functional” requirements in software development?</a></li>
<li><a href="#orge3cfe70">8.20. What is a “non-functional” requirement in software development? Provide examples as well</a></li>
<li><a href="#org2b12301">8.21. Explain Spring Velocity and how it is calculated</a></li>
<li><a href="#orgaba0147">8.22. What is an Agile Method</a></li>
<li><a href="#org2880d52">8.23. What does the terms “chickens” and “pigs” relate to with respect to Scrum?</a></li>
<li><a href="#org51d1ce4">8.24. Describe in detail the Scrum lifecycle and outline the roles, ceremonies and artifacts involved in the Scrum methodology</a></li>
<li><a href="#orga9112f5">8.25. What is Maven in Java?</a></li>
<li><a href="#orgfc642ee">8.26. Some common Maven goals:</a></li>
<li><a href="#org12ded8a">8.27. What is static testing?</a></li>
<li><a href="#orgce88aac">8.28. In software development Describe the fundamental test process using a diagram.</a></li>
<li><a href="#orgf271a02">8.29. Describe the different test levels you might expect to find in a software development project.</a></li>
</ul>
</li>
<li><a href="#org8932aba">9. Remove at the End</a></li>
</ul>
</div>
</div>
<div id="outline-container-org923d1c7" class="outline-2">
<h2 id="org923d1c7"><span class="section-number-2">1.</span> Assesment</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3f8cc86" class="outline-3">
<h3 id="org3f8cc86"><span class="section-number-3">1.1.</span> Scrum Quiz: 24th July</h3>
</div>

<div id="outline-container-org5969f6b" class="outline-3">
<h3 id="org5969f6b"><span class="section-number-3">1.2.</span> Written Test - closed book: 31st July</h3>
</div>

<div id="outline-container-org9f56f50" class="outline-3">
<h3 id="org9f56f50"><span class="section-number-3">1.3.</span> Unit Testing PC based open book: 7th August</h3>
</div>
</div>
<div id="outline-container-orgb357594" class="outline-2">
<h2 id="orgb357594"><span class="section-number-2">2.</span> Resources</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3f0e5ce" class="outline-3">
<h3 id="org3f0e5ce"><span class="section-number-3">2.1.</span> Extreme Programming Explained: Addison-Wesley</h3>
</div>

<div id="outline-container-org4752d37" class="outline-3">
<h3 id="org4752d37"><span class="section-number-3">2.2.</span> Scrum and XP from the Trenches: Henrik Kniberg</h3>
</div>

<div id="outline-container-org836e227" class="outline-3">
<h3 id="org836e227"><span class="section-number-3">2.3.</span> The Scrum Master Training Manual</h3>
</div>

<div id="outline-container-org32b1d12" class="outline-3">
<h3 id="org32b1d12"><span class="section-number-3">2.4.</span> www.scrumtrainingseries.com</h3>
</div>

<div id="outline-container-orgf16572a" class="outline-3">
<h3 id="orgf16572a"><span class="section-number-3">2.5.</span> scrummethodology.com</h3>
</div>

<div id="outline-container-orgd6b6e62" class="outline-3">
<h3 id="orgd6b6e62"><span class="section-number-3">2.6.</span> scrum.org</h3>
</div>
</div>
<div id="outline-container-orgdd4bed1" class="outline-2">
<h2 id="orgdd4bed1"><span class="section-number-2">3.</span> Definitions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9610b9e" class="outline-3">
<h3 id="org9610b9e"><span class="section-number-3">3.1.</span> User Stories</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Are requirements for the software</li>
</ul>
</div>
</div>
<div id="outline-container-orgfa2210f" class="outline-3">
<h3 id="orgfa2210f"><span class="section-number-3">3.2.</span> Scrum, XP, Kanban</h3>
</div>

<div id="outline-container-orgceb16cb" class="outline-3">
<h3 id="orgceb16cb"><span class="section-number-3">3.3.</span> Version Control</h3>
</div>

<div id="outline-container-org82787af" class="outline-3">
<h3 id="org82787af"><span class="section-number-3">3.4.</span> Basic Unit Testing</h3>
</div>

<div id="outline-container-org1b882a1" class="outline-3">
<h3 id="org1b882a1"><span class="section-number-3">3.5.</span> Testing</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>The result of software failures is a DAMAGED REPUTATION to self and the company</li>
<li>Testing objectives: Finding defects in the software, confirming that the system works, assessing the quality of the software, reducing maintenance costs (as a side effect)</li>
<li>Testing goal: To validate whether the test object (feature) works as expected by the users and other stakeholders</li>
</ul>
</div>
</div>
<div id="outline-container-org2d0e470" class="outline-3">
<h3 id="org2d0e470"><span class="section-number-3">3.6.</span> Software</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Computer programs and associated documentation such as requirements, design models and user manuals.</li>
<li>Be cautious of the defects</li>
<li>Cost: software is generally more expensive than hardware. Software engineering is concerned with cost-effective software development</li>
</ul>
</div>
</div>
<div id="outline-container-orge3526fc" class="outline-3">
<h3 id="orge3526fc"><span class="section-number-3">3.7.</span> The Software Process</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>Activities: Specification, Development, Validation, Evolution</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org87d2b63" class="outline-2">
<h2 id="org87d2b63"><span class="section-number-2">4.</span> Challenges Of Software</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Complex Requirements</li>
<li>Compatibility Issues</li>
<li>Cost Estimation and Milestones</li>
</ul>
</div>
</div>
<div id="outline-container-org9784379" class="outline-2">
<h2 id="org9784379"><span class="section-number-2">5.</span> Agile Methodology</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgee0f033" class="outline-3">
<h3 id="orgee0f033"><span class="section-number-3">5.1.</span> The Core</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>For Customers</li>
<li>For Development Teams</li>
<li>Overall Advantages</li>
</ul>
</div>
</div>
<div id="outline-container-org6d8627f" class="outline-3">
<h3 id="org6d8627f"><span class="section-number-3">5.2.</span> Iterative</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Plan</li>
<li>Design</li>
<li>Develop</li>
<li>Test</li>
<li>Deploy</li>
<li>Feedback</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd2d8f2f" class="outline-2">
<h2 id="orgd2d8f2f"><span class="section-number-2">6.</span> User Stories</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4472845" class="outline-3">
<h3 id="org4472845"><span class="section-number-3">6.1.</span> Addressing the problem</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgdcdcfd8" class="outline-4">
<h4 id="orgdcdcfd8">Software Requirements</h4>
<div class="outline-text-4" id="text-orgdcdcfd8">
<ul class="org-ul">
<li>Software requirement is a communications problem</li>
<li>Those who want software must communicate with those who build it</li>
</ul>
</div>
</div>
<div id="outline-container-org1a9f755" class="outline-4">
<h4 id="org1a9f755">One Side is Dominant</h4>
<div class="outline-text-4" id="text-org1a9f755">
<ul class="org-ul">
<li>Neither side of the Business or Software devs should be dominant
<ul class="org-ul">
<li>Business dominant ex.: I need this, by this date, make it so</li>
<li>Software dev dominant ex.: Replacing the business language with tech jargon</li>
</ul></li>
</ul>
</div>
</div>
