notes/cse/software-design-and-testing.org
*** Resource Allocation
    - Has to be a shared problem
    - Businesses tend to want more than they can get in a given time (I need this and I need it by September)
    - If devs are responsible:
      - Trade quality for features
      - Partial implementation of features
      - Making decisions that should involve the business
    - If business is responsible:
      - Lengthy requirements and sign-offs (leads to waterfall), overwhelm the dev team, which then leads to the second point
      - Features are gradually dropped as deadline loos

*** Imperfect Schedules
    - Cannot perfectly predict a software schedule, as no two software products are the same and no two software devs are the same
      - As Software evolves, users get new ideas for the software
      - Too many intangibles
      - Devs have generally a hard time estimating
    - If you can't predict a schedule, you can't predict which features will be delivered
    - So what to do?
      - Make decisions based on the information you have, but do it often
      - Rather than make one decision make those decisions throughout the project

** User Stories are a pointer to the requirement (in programmer's terms)

** The three C's (how user stories are usually created)
   - Cards (written description, estimation annotation, notes, etc.)
   - Conversation (discussion about it with the product owner in particular, but with the team in general, perhaps the most important *C*)
   - Confirmation (test for completion, acceptance tests confirm a story was coded correctly)

** Definition of User Story
   - As a <role>
   - I want <goal>
   - So that <benefit> (sometimes it is not necessary)
   - Acceptance Test (Acceptance Criteria) aka CONDITIONS OF SATISFACTION
     - The Given/When/Then Form:
       - *Given*
       - *And*
       - *When*
       - *Then*
       - *And* if any
     - The Verify Form:
       - Verif that...

*** Adding more detail to a story
    - More detailed Acceptance Criteria
    - Break down to smaller User Stories (usually you can use the Acceptance Criteria as templates for the smaller stories)

** Example (note that importance of SO THAT)
   *As an* Account Manager
   *I want* a sales report of my account to be sent to my inbox daily
   *So that* I can monitor the sales progress of my customer portfolio

   Acceptance Test:
   1. Valid Product added - success
   *Given* I am logged in as an admin
   *And* I am on the "Add Product" form
   *When* I fill in all the required fields
   *And* I click the "Add Product" button
   *Then* I get a "product added successfully" message
   *And* the product is visible in the Product List

   2. Missing required fields - fail
   *Given* xxxxx
   *And* xxxxx
   *When* xxxxx
   *And* xxxxx
   *Then* xxxxx

** User Story Types
   - *Epic*: A large one
   - *Theme*: A collection of related user stories (usually sit under an Epic, but don't have to)

** Product Backlog
   - Have small items on the top, priority
   - Big items on the bottom, to be broken down or are of least priority
   - *Grooming the Backlog*: keeping it in good shape

** Story writing workshops
   - Involve as many stakeholders and the team itself
   - Typically done every few sprints, but not too often as to not overload the team
   - Brainstorm to generate the stories
   - The goal is to write as many stories as possible
   - No prioritization at this point, but can be done to distinguish what is truly important
   - Start with epics and then iterate to break them down

** Why User Stories?
   - Shift focus from writing to talking
   - Words are imprecise, some examples: "Entree comes with soup or salad and a bread." "The user can enter a name. It can be 127 characters."
   - User Stories are more understandable and support/encourage iterative development
   - Stories are the right size for planning
   - Stories support participatory design

** DON'T FORGET
   - The story text we write on the cards is less important than the conversations we have

** INVEST
   - Independent
   - Negotiable
   - Valuable (most important)
   - Estimatable
   - Small
   - Testable

* SCRUM

** Definition
   #+begin_verse
Scrum is a lightweight framework that helps people, teams and organizations generate value through adaptive solutions for complex problems.
   #+end_verse

** Scrum requires a Scrum Master to foster an environment where:
   - A Product Owner orders the work for a complex problem into a Product Backlog.
   - The Scrum Team runs a selection of the work into an Increment of value during a Sprint.
   - The Scrum Team and its stakeholders inspect the results and adjust for the next Sprint.
   - Repeat

** Scrum is simple
   - Framework is purposefully incomplete
   - Is built upon the collective intelligence of the people using it
   - Rather than providing detailed instructions, the rules provide guidelines
   - Wraps around existing practices or renders them obsolete
   - Makes relative efficacy of current management, environment and work techniques; so that improvements can be made

** Scrum Theory
   - Founded on empiricism and lean thinking
     - Empiricism asserts that knowledge comes from experience and decisions are made based on what is observed
     - Lean thinking reduces waste and focuses on essentials
   - Employs an iterative, incremental approach to optimize predictability and to control risk
   - Combines four formal events for inspection and adaptation within a containing event: The Sprint.
     - Sprint Planning
     - Daily Scrum
     - Sprint Review
     - Sprint Retrospective
   - Sprint events work because they implement empirical pillars of Scrum: transparency, inspection and adaptation

** Pillars Of Scrum

