notes/cse/software-design-and-testing.html
<div id="outline-container-orga0f8bdd" class="outline-4">
<h4 id="orga0f8bdd">Resource Allocation</h4>
<div class="outline-text-4" id="text-orga0f8bdd">
<ul class="org-ul">
<li>Has to be a shared problem</li>
<li>Businesses tend to want more than they can get in a given time (I need this and I need it by September)</li>
<li>If devs are responsible:
<ul class="org-ul">
<li>Trade quality for features</li>
<li>Partial implementation of features</li>
<li>Making decisions that should involve the business</li>
</ul></li>
<li>If business is responsible:
<ul class="org-ul">
<li>Lengthy requirements and sign-offs (leads to waterfall), overwhelm the dev team, which then leads to the second point</li>
<li>Features are gradually dropped as deadline loos</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2a34ea3" class="outline-4">
<h4 id="org2a34ea3">Imperfect Schedules</h4>
<div class="outline-text-4" id="text-org2a34ea3">
<ul class="org-ul">
<li>Cannot perfectly predict a software schedule, as no two software products are the same and no two software devs are the same
<ul class="org-ul">
<li>As Software evolves, users get new ideas for the software</li>
<li>Too many intangibles</li>
<li>Devs have generally a hard time estimating</li>
</ul></li>
<li>If you can't predict a schedule, you can't predict which features will be delivered</li>
<li>So what to do?
<ul class="org-ul">
<li>Make decisions based on the information you have, but do it often</li>
<li>Rather than make one decision make those decisions throughout the project</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgda9f54e" class="outline-3">
<h3 id="orgda9f54e"><span class="section-number-3">6.2.</span> User Stories are a pointer to the requirement (in programmer's terms)</h3>
</div>

<div id="outline-container-org8ee133e" class="outline-3">
<h3 id="org8ee133e"><span class="section-number-3">6.3.</span> The three C's (how user stories are usually created)</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Cards (written description, estimation annotation, notes, etc.)</li>
<li>Conversation (discussion about it with the product owner in particular, but with the team in general, perhaps the most important <b>C</b>)</li>
<li>Confirmation (test for completion, acceptance tests confirm a story was coded correctly)</li>
</ul>
</div>
</div>
<div id="outline-container-orgd234d11" class="outline-3">
<h3 id="orgd234d11"><span class="section-number-3">6.4.</span> Definition of User Story</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>As a &lt;role&gt;</li>
<li>I want &lt;goal&gt;</li>
<li>So that &lt;benefit&gt; (sometimes it is not necessary)</li>
<li>Acceptance Test (Acceptance Criteria) aka CONDITIONS OF SATISFACTION
<ul class="org-ul">
<li>The Given/When/Then Form:
<ul class="org-ul">
<li><b>Given</b></li>
<li><b>And</b></li>
<li><b>When</b></li>
<li><b>Then</b></li>
<li><b>And</b> if any</li>
</ul></li>
<li>The Verify Form:
<ul class="org-ul">
<li>Verif that&#x2026;</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org2ba97ac" class="outline-4">
<h4 id="org2ba97ac">Adding more detail to a story</h4>
<div class="outline-text-4" id="text-org2ba97ac">
<ul class="org-ul">
<li>More detailed Acceptance Criteria</li>
<li>Break down to smaller User Stories (usually you can use the Acceptance Criteria as templates for the smaller stories)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5469a4f" class="outline-3">
<h3 id="org5469a4f"><span class="section-number-3">6.5.</span> Example (note that importance of SO THAT)</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<b>As an</b> Account Manager
<b>I want</b> a sales report of my account to be sent to my inbox daily
<b>So that</b> I can monitor the sales progress of my customer portfolio
</p>

<p>
Acceptance Test:
</p>
<ol class="org-ol">
<li>Valid Product added - success</li>
</ol>
<p>
<b>Given</b> I am logged in as an admin
<b>And</b> I am on the "Add Product" form
<b>When</b> I fill in all the required fields
<b>And</b> I click the "Add Product" button
<b>Then</b> I get a "product added successfully" message
<b>And</b> the product is visible in the Product List
</p>

<ol class="org-ol">
<li>Missing required fields - fail</li>
</ol>
<p>
<b>Given</b> xxxxx
<b>And</b> xxxxx
<b>When</b> xxxxx
<b>And</b> xxxxx
<b>Then</b> xxxxx
</p>
</div>
</div>
<div id="outline-container-orgacd7df4" class="outline-3">
<h3 id="orgacd7df4"><span class="section-number-3">6.6.</span> User Story Types</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li><b>Epic</b>: A large one</li>
<li><b>Theme</b>: A collection of related user stories (usually sit under an Epic, but don't have to)</li>
</ul>
</div>
</div>
<div id="outline-container-org06b6095" class="outline-3">
<h3 id="org06b6095"><span class="section-number-3">6.7.</span> Product Backlog</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li>Have small items on the top, priority</li>
<li>Big items on the bottom, to be broken down or are of least priority</li>
<li><b>Grooming the Backlog</b>: keeping it in good shape</li>
</ul>
</div>
</div>
<div id="outline-container-org0c75822" class="outline-3">
<h3 id="org0c75822"><span class="section-number-3">6.8.</span> Story writing workshops</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>Involve as many stakeholders and the team itself</li>
<li>Typically done every few sprints, but not too often as to not overload the team</li>
<li>Brainstorm to generate the stories</li>
<li>The goal is to write as many stories as possible</li>
<li>No prioritization at this point, but can be done to distinguish what is truly important</li>
<li>Start with epics and then iterate to break them down</li>
</ul>
</div>
</div>
<div id="outline-container-orgd98581d" class="outline-3">
<h3 id="orgd98581d"><span class="section-number-3">6.9.</span> Why User Stories?</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li>Shift focus from writing to talking</li>
<li>Words are imprecise, some examples: "Entree comes with soup or salad and a bread." "The user can enter a name. It can be 127 characters."</li>
<li>User Stories are more understandable and support/encourage iterative development</li>
<li>Stories are the right size for planning</li>
<li>Stories support participatory design</li>
</ul>
</div>
</div>
<div id="outline-container-orgec663b9" class="outline-3">
<h3 id="orgec663b9"><span class="section-number-3">6.10.</span> DON'T FORGET</h3>
<div class="outline-text-3" id="text-6-10">
<ul class="org-ul">
<li>The story text we write on the cards is less important than the conversations we have</li>
</ul>
</div>
</div>
<div id="outline-container-org4f99a6f" class="outline-3">
<h3 id="org4f99a6f"><span class="section-number-3">6.11.</span> INVEST</h3>
<div class="outline-text-3" id="text-6-11">
<ul class="org-ul">
<li>Independent</li>
<li>Negotiable</li>
<li>Valuable (most important)</li>
<li>Estimatable</li>
<li>Small</li>
<li>Testable</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org70e93bd" class="outline-2">
<h2 id="org70e93bd"><span class="section-number-2">7.</span> SCRUM</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgf66ab67" class="outline-3">
<h3 id="orgf66ab67"><span class="section-number-3">7.1.</span> Definition</h3>
<div class="outline-text-3" id="text-7-1">
<p class="verse">
Scrum is a lightweight framework that helps people, teams and organizations generate value through adaptive solutions for complex problems.<br />
</p>
</div>
</div>
<div id="outline-container-org9df0b53" class="outline-3">
<h3 id="org9df0b53"><span class="section-number-3">7.2.</span> Scrum requires a Scrum Master to foster an environment where:</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>A Product Owner orders the work for a complex problem into a Product Backlog.</li>
<li>The Scrum Team runs a selection of the work into an Increment of value during a Sprint.</li>
<li>The Scrum Team and its stakeholders inspect the results and adjust for the next Sprint.</li>
<li>Repeat</li>
</ul>
</div>
</div>
<div id="outline-container-orge4fb372" class="outline-3">
<h3 id="orge4fb372"><span class="section-number-3">7.3.</span> Scrum is simple</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Framework is purposefully incomplete</li>
<li>Is built upon the collective intelligence of the people using it</li>
<li>Rather than providing detailed instructions, the rules provide guidelines</li>
<li>Wraps around existing practices or renders them obsolete</li>
<li>Makes relative efficacy of current management, environment and work techniques; so that improvements can be made</li>
</ul>
</div>
</div>
<div id="outline-container-org981f9ee" class="outline-3">
<h3 id="org981f9ee"><span class="section-number-3">7.4.</span> Scrum Theory</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>Founded on empiricism and lean thinking
<ul class="org-ul">
<li>Empiricism asserts that knowledge comes from experience and decisions are made based on what is observed</li>
<li>Lean thinking reduces waste and focuses on essentials</li>
</ul></li>
<li>Employs an iterative, incremental approach to optimize predictability and to control risk</li>
<li>Combines four formal events for inspection and adaptation within a containing event: The Sprint.
<ul class="org-ul">
<li>Sprint Planning</li>
<li>Daily Scrum</li>
<li>Sprint Review</li>
<li>Sprint Retrospective</li>
</ul></li>
<li>Sprint events work because they implement empirical pillars of Scrum: transparency, inspection and adaptation</li>
</ul>
</div>
</div>
