notes/cse/software-design-and-testing.org
*** Transparency
    - The process and the work must be visible to those performing the work as well as the ones receiving the work
    - Artifacts that have low transparency can lead to decisions that diminish value and increase risk
    - Enables Inspection
    - Inspection without transparency is misleading and wasteful

*** Inspection
    - Scrum artifacts and the progress towards agreed goals must be inspected frequently and diligently to detect potentially undesirable variance or problems.
    - To help with inspection, Scrum provides cadence in the form of its five events
    - Inspection enables Adaptation. Inspection without Adaptation is considered pointless.
    - Scrum events are designed to provoke change.

*** Adaptation
    - If any aspects of a process deviate outside acceptable limits or if the result is not acceptable, the process being applied or materials used must be adjusted.
    - Adjust as soon as possible to minimize further deviation
    - Adaptation is difficult if the people involved aren't empowered or self-managing.
    - Scrum team is supposed to adapt the moment it learns of anything via inspection

** Scrum Values
   - *Commitment*, *Focus*, *Openness*, *Respect*, *Courage*
   - The team commits to achieve a goal and support each other
   - Focus on the work of the Sprint to make the best possible progress
   - Team and the stakeholders are open the work and the challenges
   - Respect each other to be capable and independent
   - Have the courage to work through tough problems and do the right thing

     #+begin_verse
     The above values are utilised by the team and people they work with. If applied well the pillars of transparency, inspection and adaptation come to life building trust.
     #+end_verse

** Scrum Team

*** Consists of a small team, generally:
    - One Scrum Master
    - One Product Owner
    - Developers
    - No sub-teams and no hierarchies
    - Cohesive unit of professionals focused on the one objective: Product Goal
    - Typically 10 or fewer people
    - Usually smaller teams work better, communicate better and are more productive
    - Too large a team should perhaps split into own Scrum Teams with the same focus on the same product: share same Product Goal, Product Backlog and Product Owner.

*** Team is cross-functional
    - Each member has the skills necessary to create value during each Sprint

*** Self-managing
    - Internally decide who does what, when and how.

*** Responsible for all product-related activities
    - Stakeholder collaboration
    - Verification
    - Maintenance
    - Operation
    - Experimentation
    - Research and Development
    - Anything else that might be required

*** Accountability
    - Accountable for creating a value, useful Increment every Sprint
    - Three specific accountabilities within the Scrum Team
      - The Developers
      - The Product Owner
      - The Scrum Master

*** Developers
    - Are the people that are committed to creating any aspect of usable Increment each Sprint
    - The skills necessary may be broad and vary depending on the domain
    - But are always accountable for:
      - Creating a plan for the Sprint, the Sprint Backlog
      - Instilling quality by following the Definition of Done
      - Adapting their plan each day toward the Sprint Goal
      - Holding each other accountable as professionals

*** Product Owner
    - Accountable for maximising the value of the product resulting from the work of the Scrum Team
    - Accountable for effective Product Backlog management, which includes:
      - Developing and explicitly communicating the Product Goal
      - Creating and clearly communicating Product Backlog items
      - Ordering Product Backlog items
      - Ensuring Product Backlog is transparent, visible and understood
    - The Product Owner may delegate his tasks to others, but is held accountable nonetheless
    - The decisions of the Product Owner are transparent via the Product Backlog and through inspectable Increment at the Sprint Review
    - If anyone wants to change the Product Backlog they need to convince the Product Owner to do so

*** Scrum Master
    - Accountable for establishing Scrum as defined by the Guide
    - Help everyone understand Scrum and its practices and theories, both withing a team and the organisation
    - Is accountable for the team's effectiveness. This is achieved by improving the team's practices within the Scrum framework
    - Are true leaders who serve the Team and the organisation
    - Some ways how Scrum Masters serve the team:
      - Coaching in self-management and cross-functionality
      - Help the team in creating high-value Increments that meet DoD
      - Remove impediments to the team's progress
      - Ensure all Scrum events take place and are positive, productive and kept within a timebox
    - The Scrum Master serves the Product Owner:
      - Help with techniques for better Product Goal definitions and Product Backlog management
      - Help understand the need for clear and concise Product Backlog items
      - Help in establishing empirical product planning for a complex environment
      - Facilitate stakeholder collaboration as requested or when needed
    - The Scrum Master serves the organisation:
      - Lead, train and coach the org in Scrum adoption
      - Plan and advise Scrum implementations within the org
      - Help employees and stakeholder understand and enact an empirical approach for complex work
      - Remove barriers between stakeholders and the Scrum Team

** Scrum Events
   - Events exist to create regularity and to minimize meetings not defined in Scrum
   - Failure to operate any events results in a lost opportunity to inspect and adapt

