notes/cse/software-design-and-testing.html
<div id="outline-container-orga9b8b02" class="outline-3">
<h3 id="orga9b8b02"><span class="section-number-3">7.5.</span> Pillars Of Scrum</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-orgd58c82a" class="outline-4">
<h4 id="orgd58c82a">Transparency</h4>
<div class="outline-text-4" id="text-orgd58c82a">
<ul class="org-ul">
<li>The process and the work must be visible to those performing the work as well as the ones receiving the work</li>
<li>Artifacts that have low transparency can lead to decisions that diminish value and increase risk</li>
<li>Enables Inspection</li>
<li>Inspection without transparency is misleading and wasteful</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3b2e5f" class="outline-4">
<h4 id="orgb3b2e5f">Inspection</h4>
<div class="outline-text-4" id="text-orgb3b2e5f">
<ul class="org-ul">
<li>Scrum artifacts and the progress towards agreed goals must be inspected frequently and diligently to detect potentially undesirable variance or problems.</li>
<li>To help with inspection, Scrum provides cadence in the form of its five events</li>
<li>Inspection enables Adaptation. Inspection without Adaptation is considered pointless.</li>
<li>Scrum events are designed to provoke change.</li>
</ul>
</div>
</div>
<div id="outline-container-org963fd2d" class="outline-4">
<h4 id="org963fd2d">Adaptation</h4>
<div class="outline-text-4" id="text-org963fd2d">
<ul class="org-ul">
<li>If any aspects of a process deviate outside acceptable limits or if the result is not acceptable, the process being applied or materials used must be adjusted.</li>
<li>Adjust as soon as possible to minimize further deviation</li>
<li>Adaptation is difficult if the people involved aren't empowered or self-managing.</li>
<li>Scrum team is supposed to adapt the moment it learns of anything via inspection</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org13c9d96" class="outline-3">
<h3 id="org13c9d96"><span class="section-number-3">7.6.</span> Scrum Values</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li><b>Commitment</b>, <b>Focus</b>, <b>Openness</b>, <b>Respect</b>, <b>Courage</b></li>
<li>The team commits to achieve a goal and support each other</li>
<li>Focus on the work of the Sprint to make the best possible progress</li>
<li>Team and the stakeholders are open the work and the challenges</li>
<li>Respect each other to be capable and independent</li>
<li><p>
Have the courage to work through tough problems and do the right thing
</p>

<p class="verse">
The above values are utilised by the team and people they work with. If applied well the pillars of transparency, inspection and adaptation come to life building trust.<br />
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org66a0c5e" class="outline-3">
<h3 id="org66a0c5e"><span class="section-number-3">7.7.</span> Scrum Team</h3>
<div class="outline-text-3" id="text-7-7">
</div>
<div id="outline-container-orgde567c0" class="outline-4">
<h4 id="orgde567c0">Consists of a small team, generally:</h4>
<div class="outline-text-4" id="text-orgde567c0">
<ul class="org-ul">
<li>One Scrum Master</li>
<li>One Product Owner</li>
<li>Developers</li>
<li>No sub-teams and no hierarchies</li>
<li>Cohesive unit of professionals focused on the one objective: Product Goal</li>
<li>Typically 10 or fewer people</li>
<li>Usually smaller teams work better, communicate better and are more productive</li>
<li>Too large a team should perhaps split into own Scrum Teams with the same focus on the same product: share same Product Goal, Product Backlog and Product Owner.</li>
</ul>
</div>
</div>
<div id="outline-container-org4315a59" class="outline-4">
<h4 id="org4315a59">Team is cross-functional</h4>
<div class="outline-text-4" id="text-org4315a59">
<ul class="org-ul">
<li>Each member has the skills necessary to create value during each Sprint</li>
</ul>
</div>
</div>
<div id="outline-container-org5511dce" class="outline-4">
<h4 id="org5511dce">Self-managing</h4>
<div class="outline-text-4" id="text-org5511dce">
<ul class="org-ul">
<li>Internally decide who does what, when and how.</li>
</ul>
</div>
</div>
<div id="outline-container-orgee6b048" class="outline-4">
<h4 id="orgee6b048">Responsible for all product-related activities</h4>
<div class="outline-text-4" id="text-orgee6b048">
<ul class="org-ul">
<li>Stakeholder collaboration</li>
<li>Verification</li>
<li>Maintenance</li>
<li>Operation</li>
<li>Experimentation</li>
<li>Research and Development</li>
<li>Anything else that might be required</li>
</ul>
</div>
</div>
<div id="outline-container-orgaef8b1b" class="outline-4">
<h4 id="orgaef8b1b">Accountability</h4>
<div class="outline-text-4" id="text-orgaef8b1b">
<ul class="org-ul">
<li>Accountable for creating a value, useful Increment every Sprint</li>
<li>Three specific accountabilities within the Scrum Team
<ul class="org-ul">
<li>The Developers</li>
<li>The Product Owner</li>
<li>The Scrum Master</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5382963" class="outline-4">
<h4 id="org5382963">Developers</h4>
<div class="outline-text-4" id="text-org5382963">
<ul class="org-ul">
<li>Are the people that are committed to creating any aspect of usable Increment each Sprint</li>
<li>The skills necessary may be broad and vary depending on the domain</li>
<li>But are always accountable for:
<ul class="org-ul">
<li>Creating a plan for the Sprint, the Sprint Backlog</li>
<li>Instilling quality by following the Definition of Done</li>
<li>Adapting their plan each day toward the Sprint Goal</li>
<li>Holding each other accountable as professionals</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org356f3ff" class="outline-4">
<h4 id="org356f3ff">Product Owner</h4>
<div class="outline-text-4" id="text-org356f3ff">
<ul class="org-ul">
<li>Accountable for maximising the value of the product resulting from the work of the Scrum Team</li>
<li>Accountable for effective Product Backlog management, which includes:
<ul class="org-ul">
<li>Developing and explicitly communicating the Product Goal</li>
<li>Creating and clearly communicating Product Backlog items</li>
<li>Ordering Product Backlog items</li>
<li>Ensuring Product Backlog is transparent, visible and understood</li>
</ul></li>
<li>The Product Owner may delegate his tasks to others, but is held accountable nonetheless</li>
<li>The decisions of the Product Owner are transparent via the Product Backlog and through inspectable Increment at the Sprint Review</li>
<li>If anyone wants to change the Product Backlog they need to convince the Product Owner to do so</li>
</ul>
</div>
</div>
<div id="outline-container-orge3b1f51" class="outline-4">
<h4 id="orge3b1f51">Scrum Master</h4>
<div class="outline-text-4" id="text-orge3b1f51">
<ul class="org-ul">
<li>Accountable for establishing Scrum as defined by the Guide</li>
<li>Help everyone understand Scrum and its practices and theories, both withing a team and the organisation</li>
<li>Is accountable for the team's effectiveness. This is achieved by improving the team's practices within the Scrum framework</li>
<li>Are true leaders who serve the Team and the organisation</li>
<li>Some ways how Scrum Masters serve the team:
<ul class="org-ul">
<li>Coaching in self-management and cross-functionality</li>
<li>Help the team in creating high-value Increments that meet DoD</li>
<li>Remove impediments to the team's progress</li>
<li>Ensure all Scrum events take place and are positive, productive and kept within a timebox</li>
</ul></li>
<li>The Scrum Master serves the Product Owner:
<ul class="org-ul">
<li>Help with techniques for better Product Goal definitions and Product Backlog management</li>
<li>Help understand the need for clear and concise Product Backlog items</li>
<li>Help in establishing empirical product planning for a complex environment</li>
<li>Facilitate stakeholder collaboration as requested or when needed</li>
</ul></li>
<li>The Scrum Master serves the organisation:
<ul class="org-ul">
<li>Lead, train and coach the org in Scrum adoption</li>
<li>Plan and advise Scrum implementations within the org</li>
<li>Help employees and stakeholder understand and enact an empirical approach for complex work</li>
<li>Remove barriers between stakeholders and the Scrum Team</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfdf28ac" class="outline-3">
<h3 id="orgfdf28ac"><span class="section-number-3">7.8.</span> Scrum Events</h3>
<div class="outline-text-3" id="text-7-8">
<ul class="org-ul">
<li>Events exist to create regularity and to minimize meetings not defined in Scrum</li>
<li>Failure to operate any events results in a lost opportunity to inspect and adapt</li>
</ul>
</div>
