notes/cse/software-design-and-testing.org
*** The Sprint
    - Is the heartbeat of Scrum
    - Fixed length, usually a month
    - New one starts immediately after the conclusion of the previous Sprint
    - All the work that is necessary to achieve the Product Goal (Sprint Planning, Daily Scrums, Sprint Review, Sprint Retrospective) happen within Sprints
    - During the Sprint:
      - No changes are made to endanger the Sprint Goal
      - Quality does not decrease
      - Product Backlog is refined as needed
      - Scope may be clarified and negotiated with the Product Owner as more is learned
    - Sprints enable predictability by ensuring inspection and adaptation of progress toward a Product Goal at least once a month
    - Shorter sprints can be employed to encourage faster learning, however, longer sprints can stray away from the over goal, the Sprint Goal
    - Each Sprint can be considered a mini-project (and now this whole thing makes much more sense)
    - Various practices exist to forecast progress: burn-downs, burn-ups, cumulative flow, etc.
      - However, remember that in complex environments what will happen is unknown. Only what has happened may be used for future decision making (empiricism).
    - Sprint may be cancelled if the Spring Goal becomes obsolete. Only the Product Owner has the authority to do so.

*** Sprint Planning
    - Initiates the Sprint by laying out the work to be performed for the Sprint
    - Is created by the entire Scrum Team
    - PO ensures attendees are prepared to discuss most important PB items and how they map to the Product Goal
    - The team may invite other people to provide advice
    - Sprint Planning addresses the following topics:
      - Why is this Sprint Valuable? - Sprint Goal must be finalized at the end of Sprint Planning, so the PO proposes how to increase value and utility in the Current Sprint, then the team collaborates to define a Sprint Goal. The Sprint Goal communicates why the Goal is valuable.
      - What can be Done this Sprint? - PO and the Devs discuss which items from the PB to include in the Sprint. The items may be refined during this process by the team (increases understanding and confidence of what is being done). Selecting items may be hard but empiricism helps as time goes by.
      - How will the chosen work get done? - Each item from PB is planned by the Devs to create an Increment that meets the DoD. Often this is accomplished by decomposing an item into tasks/sub-tasks. This is purely at the discretion of the Devs on how they approach this process. No one tells the Devs how to turn PB items into Increments of value.
    - The timebox for planning is usually 8 hours in a one-month Sprint. For shorter sprints it is less than that.
    - The Sprint Goal, PB's items selected for the Sprint and the Delivery Plan of said items are together referred to as the: Sprint Backlog

*** Daily Scrum
    - Goal is to inspect progress towards the Sprint Goal and adapt the Sprint Backlog if necessary (adjust the upcoming planned work)
    - Is a 15-minute event for the Developers of the Scrum Team
    - Is usually held at the same time and place every working day of the Sprint
    - If the PO or Scrum Master are actively working on items from the Sprint Backlog they participate as Devs
    - Devs select whatever structure and technique they want, for as long as their Daily Scrum focuses on progress towards the Sprint Goal and produces an actionable plan for the next day (create focus and improves self-management)
    - General goals:
      - Improve communication
      - Identify impediments
      - Promote quick decision making
      - Eliminate needs for other meetings (hopefully), however, if necessary other meetings happen throughout the day for more detailed discussions and plan adjustments

*** Sprint Review
    - Inspect the outcome of the Sprint, determine future adaptations
    - Present results to key stakeholders and progress towards the Product Goal (discuss progress as well)
    - Team and stakeholders discuss what was accomplished in the Sprint and what has changed
    - Based on all the information provided a discussion ensues on what to do next
    - Product Backlog may be adjusted to meet new opportunities
    - Is a working session and should not be a simple presentation
    - Is the second to last event, usually timeboxed to 4 hours for a one-month Sprint, less for shorter Sprints.

*** Sprint Retrospective
    - Purpose: Plan ways to increase quality and effectiveness
    - Scrum Team inspects how the last Sprint went with regards to: Individuals, Interactions, Processes, Tools and the Definition of Done.
    - Identify assumptions and explore their origins
    - Scrum Team discusses what went well during the Sprint, what problems were encountered and how the problems were solved (or not solved)
    - Scrum Team identifies most helpful changes to improve the way forward. Most impactful improvements are addressed as soon as possible.
    - Retrospective concludes the Sprint, timeboxed to three hours for a one-month Sprint, less for shorter sprints.

** Scrum Artifacts
   - Represent work of value
   - Designed to maximise transparency of key information
   - Each artifact contains a commitment to ensure it provides information that enhances transparency and focus, this transparency and focus' progress can then be measured

*** Product Backlog
    - Emergent, ordered list of what is needed to create and improve the product.
    - Single source of work for the Scrum Team
    - Any item from the Backlog that can be done within a single Sprint is considered "ready" for Sprint Planning
    - Product Backlog refinement or grooming is the act of breaking down items into more precise items
    - It is an ongoing process that adds details, descriptions, order and size
    - Devs are responsible for the sizing
    - PO may influence the Devs by helping understand items and select trade-offs
**** Commitment: Product Goal
     - Describes a future state of the product which can serve as the target for the Scrum Team to plan against.
     - The Product Goal is in the Product Backlog
     - Is the long-term objective for the Scrum Team. Fulfil (or abandon) an objective before taking on the next

*** Sprint Backlog
    - Composed of the Sprint Goal (the: why)
    - The set of PB items selected for the Sprint (the: what)
    - Actionable plan for delivering an Increment (the: how)
    - The Sprint Backlog is a plan by and for the Developers
    - Is a high-visibility real-time picture of the work that the Devs plan to accomplish during the Sprint to achieve the Sprint Goal
    - Update the Backlog when more things are learned about the work
    - Should have enough detail that can be discussed during the Daily Scrum
