notes/cse/software-design-and-testing.html
<div id="outline-container-org260a05d" class="outline-4">
<h4 id="org260a05d">The Sprint</h4>
<div class="outline-text-4" id="text-org260a05d">
<ul class="org-ul">
<li>Is the heartbeat of Scrum</li>
<li>Fixed length, usually a month</li>
<li>New one starts immediately after the conclusion of the previous Sprint</li>
<li>All the work that is necessary to achieve the Product Goal (Sprint Planning, Daily Scrums, Sprint Review, Sprint Retrospective) happen within Sprints</li>
<li>During the Sprint:
<ul class="org-ul">
<li>No changes are made to endanger the Sprint Goal</li>
<li>Quality does not decrease</li>
<li>Product Backlog is refined as needed</li>
<li>Scope may be clarified and negotiated with the Product Owner as more is learned</li>
</ul></li>
<li>Sprints enable predictability by ensuring inspection and adaptation of progress toward a Product Goal at least once a month</li>
<li>Shorter sprints can be employed to encourage faster learning, however, longer sprints can stray away from the over goal, the Sprint Goal</li>
<li>Each Sprint can be considered a mini-project (and now this whole thing makes much more sense)</li>
<li>Various practices exist to forecast progress: burn-downs, burn-ups, cumulative flow, etc.
<ul class="org-ul">
<li>However, remember that in complex environments what will happen is unknown. Only what has happened may be used for future decision making (empiricism).</li>
</ul></li>
<li>Sprint may be cancelled if the Spring Goal becomes obsolete. Only the Product Owner has the authority to do so.</li>
</ul>
</div>
</div>
<div id="outline-container-org24daefa" class="outline-4">
<h4 id="org24daefa">Sprint Planning</h4>
<div class="outline-text-4" id="text-org24daefa">
<ul class="org-ul">
<li>Initiates the Sprint by laying out the work to be performed for the Sprint</li>
<li>Is created by the entire Scrum Team</li>
<li>PO ensures attendees are prepared to discuss most important PB items and how they map to the Product Goal</li>
<li>The team may invite other people to provide advice</li>
<li>Sprint Planning addresses the following topics:
<ul class="org-ul">
<li>Why is this Sprint Valuable? - Sprint Goal must be finalized at the end of Sprint Planning, so the PO proposes how to increase value and utility in the Current Sprint, then the team collaborates to define a Sprint Goal. The Sprint Goal communicates why the Goal is valuable.</li>
<li>What can be Done this Sprint? - PO and the Devs discuss which items from the PB to include in the Sprint. The items may be refined during this process by the team (increases understanding and confidence of what is being done). Selecting items may be hard but empiricism helps as time goes by.</li>
<li>How will the chosen work get done? - Each item from PB is planned by the Devs to create an Increment that meets the DoD. Often this is accomplished by decomposing an item into tasks/sub-tasks. This is purely at the discretion of the Devs on how they approach this process. No one tells the Devs how to turn PB items into Increments of value.</li>
</ul></li>
<li>The timebox for planning is usually 8 hours in a one-month Sprint. For shorter sprints it is less than that.</li>
<li>The Sprint Goal, PB's items selected for the Sprint and the Delivery Plan of said items are together referred to as the: Sprint Backlog</li>
</ul>
</div>
</div>
<div id="outline-container-org75eb47d" class="outline-4">
<h4 id="org75eb47d">Daily Scrum</h4>
<div class="outline-text-4" id="text-org75eb47d">
<ul class="org-ul">
<li>Goal is to inspect progress towards the Sprint Goal and adapt the Sprint Backlog if necessary (adjust the upcoming planned work)</li>
<li>Is a 15-minute event for the Developers of the Scrum Team</li>
<li>Is usually held at the same time and place every working day of the Sprint</li>
<li>If the PO or Scrum Master are actively working on items from the Sprint Backlog they participate as Devs</li>
<li>Devs select whatever structure and technique they want, for as long as their Daily Scrum focuses on progress towards the Sprint Goal and produces an actionable plan for the next day (create focus and improves self-management)</li>
<li>General goals:
<ul class="org-ul">
<li>Improve communication</li>
<li>Identify impediments</li>
<li>Promote quick decision making</li>
<li>Eliminate needs for other meetings (hopefully), however, if necessary other meetings happen throughout the day for more detailed discussions and plan adjustments</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaaa879c" class="outline-4">
<h4 id="orgaaa879c">Sprint Review</h4>
<div class="outline-text-4" id="text-orgaaa879c">
<ul class="org-ul">
<li>Inspect the outcome of the Sprint, determine future adaptations</li>
<li>Present results to key stakeholders and progress towards the Product Goal (discuss progress as well)</li>
<li>Team and stakeholders discuss what was accomplished in the Sprint and what has changed</li>
<li>Based on all the information provided a discussion ensues on what to do next</li>
<li>Product Backlog may be adjusted to meet new opportunities</li>
<li>Is a working session and should not be a simple presentation</li>
<li>Is the second to last event, usually timeboxed to 4 hours for a one-month Sprint, less for shorter Sprints.</li>
</ul>
</div>
</div>
<div id="outline-container-org3015c21" class="outline-4">
<h4 id="org3015c21">Sprint Retrospective</h4>
<div class="outline-text-4" id="text-org3015c21">
<ul class="org-ul">
<li>Purpose: Plan ways to increase quality and effectiveness</li>
<li>Scrum Team inspects how the last Sprint went with regards to: Individuals, Interactions, Processes, Tools and the Definition of Done.</li>
<li>Identify assumptions and explore their origins</li>
<li>Scrum Team discusses what went well during the Sprint, what problems were encountered and how the problems were solved (or not solved)</li>
<li>Scrum Team identifies most helpful changes to improve the way forward. Most impactful improvements are addressed as soon as possible.</li>
<li>Retrospective concludes the Sprint, timeboxed to three hours for a one-month Sprint, less for shorter sprints.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org86459cc" class="outline-3">
<h3 id="org86459cc"><span class="section-number-3">7.9.</span> Scrum Artifacts</h3>
<div class="outline-text-3" id="text-7-9">
<ul class="org-ul">
<li>Represent work of value</li>
<li>Designed to maximise transparency of key information</li>
<li>Each artifact contains a commitment to ensure it provides information that enhances transparency and focus, this transparency and focus' progress can then be measured</li>
</ul>
</div>
<div id="outline-container-orgf6f9445" class="outline-4">
<h4 id="orgf6f9445">Product Backlog</h4>
<div class="outline-text-4" id="text-orgf6f9445">
<ul class="org-ul">
<li>Emergent, ordered list of what is needed to create and improve the product.</li>
<li>Single source of work for the Scrum Team</li>
<li>Any item from the Backlog that can be done within a single Sprint is considered "ready" for Sprint Planning</li>
<li>Product Backlog refinement or grooming is the act of breaking down items into more precise items</li>
<li>It is an ongoing process that adds details, descriptions, order and size</li>
<li>Devs are responsible for the sizing</li>
<li>PO may influence the Devs by helping understand items and select trade-offs</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgcf142c8"></a>Commitment: Product Goal<br />
<div class="outline-text-5" id="text-orgcf142c8">
<ul class="org-ul">
<li>Describes a future state of the product which can serve as the target for the Scrum Team to plan against.</li>
<li>The Product Goal is in the Product Backlog</li>
<li>Is the long-term objective for the Scrum Team. Fulfil (or abandon) an objective before taking on the next</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgecc6400" class="outline-4">
<h4 id="orgecc6400">Sprint Backlog</h4>
<div class="outline-text-4" id="text-orgecc6400">
<ul class="org-ul">
<li>Composed of the Sprint Goal (the: why)</li>
<li>The set of PB items selected for the Sprint (the: what)</li>
<li>Actionable plan for delivering an Increment (the: how)</li>
<li>The Sprint Backlog is a plan by and for the Developers</li>
<li>Is a high-visibility real-time picture of the work that the Devs plan to accomplish during the Sprint to achieve the Sprint Goal</li>
<li>Update the Backlog when more things are learned about the work</li>
<li>Should have enough detail that can be discussed during the Daily Scrum</li>
</ul>
</div>
<ul class="org-ul">
