notes/cse/software-design-and-testing.html
<li><a id="org0aab8f7"></a>Commitment: Sprint Goal<br />
<div class="outline-text-5" id="text-org0aab8f7">
<ul class="org-ul">
<li>Single objective of the Sprint</li>
<li>Commitment by the Devs, but has flexibility in terms of the exact work needed to accomplish the goal</li>
<li>Creates coherence and focus. The whole team is on the same page and work together towards the same goal.</li>
<li>Is created during Sprint Planning and added to the Sprint Backlog</li>
<li>As Devs work they keep the Sprint Goal in mind</li>
<li>If the work turns out more difficult, they collaborate with the PO to negotiate the scope and hopefully achieve the Sprint Goal still</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8c85c4e" class="outline-4">
<h4 id="org8c85c4e">Increment</h4>
<div class="outline-text-4" id="text-org8c85c4e">
<ul class="org-ul">
<li>Is a concrete stepping stone towards the Product Goal</li>
<li>Each is additive with the previous one and thoroughly verified to ensure that all Increments work together</li>
<li>In order to provide value and Increment must be usable</li>
<li>Multiple Increments may be created within a Sprint</li>
<li>Increments may be presented to stakeholders sooner, Sprint Review does not need to be solely that moment</li>
<li>Work cannot be considered part of an Increment unless it meets the Definition of Done</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgdb852c8"></a>Commitment: Definition of Done<br />
<div class="outline-text-5" id="text-orgdb852c8">
<ul class="org-ul">
<li>Is a formal description of the state of an Increment when it meets the quality measures required for the product</li>
<li>When a Product Backlog item meets the Definition of Done, an Increment is made</li>
<li>DoD creates transparency. so that everyone understands what kind of work is necessary to complete a work item to create an Increment.</li>
<li>If a PB item does not meet the DoD it cannot be released or even presented at the Sprint Review. It goes back to the PB.</li>
<li>DoD may be an organizational standard, so then all Scrum Teams follow that standard. Otherwise the Scrum Team creates their own DoD appropriate for the product.</li>
<li>Devs are required to conform with DoD. If multiple teams work on a single product they all share the same DoD.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6871669" class="outline-2">
<h2 id="org6871669"><span class="section-number-2">8.</span> Revision Questions for Exam</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8ca1e35" class="outline-3">
<h3 id="org8ca1e35"><span class="section-number-3">8.1.</span> What is Software</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Computer programs and associated documentation such as requirements, design models and user manuals.</li>
<li>Be cautious of the defects</li>
<li>Cost: software is generally more expensive than hardware. Software engineering is concerned with cost-effective software development</li>
</ul>
</div>
</div>
<div id="outline-container-orga5c97b1" class="outline-3">
<h3 id="orga5c97b1"><span class="section-number-3">8.2.</span> What is Software Engineering</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Systematic application of engineering principles to the design, development, testing, deployment and maintenance</li>
<li>It is about building reliable, efficient and maintainable software in a structured and methodical way - like how civil engineers build bridges or architects design buildings</li>
<li>Key aspects:
<ul class="org-ul">
<li>Requirements analysis - understand what needs to be done</li>
<li>Design - Plan the software structure</li>
<li>Implementation - Writing the actual code</li>
<li>Testing - Check for bugs and ensure quality</li>
<li>Maintenance - Fixing issues and updating the software after release</li>
<li>Project management - Managing time, budget and teams</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org143210a" class="outline-3">
<h3 id="org143210a"><span class="section-number-3">8.3.</span> Explain why we need to engineer software and not “just code it”.</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>While anyone can code, developing <b>high-quality software</b> for real-world use requires much more than that. Some examples:</li>
<li>Complexity - Can be huge in terms of lines of code. Without planning the result is often buggy, hard to maintain or unusable</li>
<li>Scalability &amp; Maintainability - Software needs to grow, adapt and be maintained over time. "Just code it" generally creates technical debt.</li>
<li>Collaboration - Usually software is developed in teams, so clear design, documentation and standards are essential.</li>
<li>Quality Assurance - Ensure testing, reviews and quality control to minimise bugs, crashes or security flaws, which could have financial or legal consequences</li>
<li>Cost &amp; Time Efficiency - Good engineering practices prevent wasted time fixing poor code later.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspect</th>
<th scope="col" class="org-left"><b><b>Software Engineering</b></b></th>
<th scope="col" class="org-left"><b><b>Civil Engineering (e.g., Bridge)</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Nature of Product</b></b></td>
<td class="org-left">Intangible, logical systems (code)</td>
<td class="org-left">Physical structures (steel, concrete)</td>
</tr>

<tr>
<td class="org-left"><b><b>Design Tools</b></b></td>
<td class="org-left">Diagrams, code models, UML, version control</td>
<td class="org-left">Blueprints, CAD drawings, physical models</td>
</tr>

<tr>
<td class="org-left"><b><b>Changes</b></b></td>
<td class="org-left">Easier to modify (but still costly if unplanned)</td>
<td class="org-left">Very expensive or impossible to change once built</td>
</tr>

<tr>
<td class="org-left"><b><b>Failure Consequences</b></b></td>
<td class="org-left">Data loss, downtime, security risks</td>
<td class="org-left">Physical harm, property damage, lives at risk</td>
</tr>

<tr>
<td class="org-left"><b><b>Testing</b></b></td>
<td class="org-left">Simulations, unit tests, automated builds</td>
<td class="org-left">Physical stress tests, inspections, models</td>
</tr>

<tr>
<td class="org-left"><b><b>Maintenance</b></b></td>
<td class="org-left">Frequent updates, patches, refactoring</td>
<td class="org-left">Occasional inspections and repairs</td>
</tr>

<tr>
<td class="org-left"><b><b>Development Method</b></b></td>
<td class="org-left">Agile, Waterfall, DevOps, etc.</td>
<td class="org-left">More linear (Plan → Design → Build → Maintain)</td>
</tr>

<tr>
<td class="org-left"><b><b>Team Roles</b></b></td>
<td class="org-left">Developers, testers, UX designers, project managers</td>
<td class="org-left">Architects, engineers, surveyors, contractors</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgec7a69a" class="outline-3">
<h3 id="orgec7a69a"><span class="section-number-3">8.4.</span> What is a software process? Describe the common activities that are part of all software processes</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>A software process is a structured set of activities used to develop software.</li>
<li>It defines how software is created, maintained and delivered, providing a framework that guides the entire software development lifecycle (SDLC)</li>
<li>Activities:
<ul class="org-ul">
<li>Specification (requirements gathering/engineering)</li>
<li>Design and Architecture</li>
<li>Implementation</li>
<li>Testing and Validation</li>
<li>Deployment</li>
<li>Maintenance and Evolution</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge5db388" class="outline-3">
<h3 id="orge5db388"><span class="section-number-3">8.5.</span> What are the four important or essential attributes that all professional software should have? Suggest four other attributes that may sometimes be significant.</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li>Correctness - Software must do what it is supposed to do</li>
<li>Reliability - It must work consistently and accurately</li>
<li>Usability - It should be easy to use and understand for the target users</li>
<li>Maintainability - Must be easy to modify/fix/update</li>
</ul>
</div>
<div id="outline-container-orgd837018" class="outline-4">
<h4 id="orgd837018">Other significant attributes</h4>
<div class="outline-text-4" id="text-orgd837018">
<ul class="org-ul">
<li>Efficiency - Should not use too many resources</li>
<li>Security - Should protect your data and your privacy</li>
<li>Portability - Ability to run anywhere</li>
<li>Scalability - Ability to handle growing amount of work or users</li>
</ul>
</div>
</div>
</div>
