notes/cse/software-design-and-testing.html
<div id="outline-container-org42714a0" class="outline-3">
<h3 id="org42714a0"><span class="section-number-3">8.6.</span> Compare Agile and Waterfall</h3>
<div class="outline-text-3" id="text-8-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><b>Aspect</b></b></td>
<td class="org-left"><b><b>Waterfall</b></b></td>
<td class="org-left"><b><b>Agile</b></b></td>
</tr>

<tr>
<td class="org-left">------------------------</td>
<td class="org-left">----------------------------------------------------------</td>
<td class="org-left">-----------------------------------------------------------</td>
</tr>

<tr>
<td class="org-left"><b><b>Approach</b></b></td>
<td class="org-left">Linear and sequential</td>
<td class="org-left">Iterative and incremental</td>
</tr>

<tr>
<td class="org-left"><b><b>Phases</b></b></td>
<td class="org-left">Fixed stages: Requirements → Design → Code → Test → Deploy</td>
<td class="org-left">Repeated cycles (sprints) with all activities in each cycle</td>
</tr>

<tr>
<td class="org-left"><b><b>Flexibility</b></b></td>
<td class="org-left">Rigid — changes are hard to make once started</td>
<td class="org-left">Flexible — welcomes changes even late in development</td>
</tr>

<tr>
<td class="org-left"><b><b>Customer Involvement</b></b></td>
<td class="org-left">Minimal after initial planning</td>
<td class="org-left">High — continuous feedback throughout</td>
</tr>

<tr>
<td class="org-left"><b><b>Delivery</b></b></td>
<td class="org-left">One big release at the end</td>
<td class="org-left">Frequent small releases (e.g., every 2–4 weeks)</td>
</tr>

<tr>
<td class="org-left"><b><b>Best For</b></b></td>
<td class="org-left">Projects with clear, fixed requirements</td>
<td class="org-left">Projects with evolving or unclear requirements</td>
</tr>

<tr>
<td class="org-left"><b><b>Risk</b></b></td>
<td class="org-left">High — issues often discovered late</td>
<td class="org-left">Lower — problems are found early through iterations</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1a485cc" class="outline-3">
<h3 id="org1a485cc"><span class="section-number-3">8.7.</span> What are the characteristics of Agile projects?</h3>
<div class="outline-text-3" id="text-8-7">
<ul class="org-ul">
<li>Iterative and Incremental Development</li>
<li>Customer Collaboration</li>
<li>Welcomes Changes</li>
<li>Cross-Functional Teams</li>
<li>Continuous Delivery of Value</li>
<li>Face-to-Face Communication</li>
<li>Self-Organizing Teams</li>
<li>Regular Reflection and Improvement</li>
<li>Focus on Working Software</li>
<li>Simplicity</li>
</ul>
</div>
</div>
<div id="outline-container-orge18ab16" class="outline-3">
<h3 id="orge18ab16"><span class="section-number-3">8.8.</span> How is incremental different to iterative?</h3>
<div class="outline-text-3" id="text-8-8">
<ul class="org-ul">
<li>Iterative: Repeat the same process or refine product repeatedly. Build a basic version then improve/revise through repeated cycles</li>
<li>Incremental: Adding new parts or features over time. Most software is developed in small pieces (increments) that are fully functional. Each increment adds new functionality.</li>
</ul>
</div>
</div>
<div id="outline-container-org61b12ee" class="outline-3">
<h3 id="org61b12ee"><span class="section-number-3">8.9.</span> List 2 advantages of the waterfall methodology</h3>
<div class="outline-text-3" id="text-8-9">
<ul class="org-ul">
<li>Clear Structure and Documentation</li>
<li>Well-Suited for Projects with Fixed Requirements</li>
</ul>
</div>
</div>
<div id="outline-container-org6b13e0f" class="outline-3">
<h3 id="org6b13e0f"><span class="section-number-3">8.10.</span> What is the scientific method underpinning Agile methods?</h3>
<div class="outline-text-3" id="text-8-10">
<ul class="org-ul">
<li>It is rooted in Empirical Process Control</li>
<li>Empiricism: knowledge comes from <b>experience</b> and <b>observation</b>, not just upfront prediction. In Agile this is especially reflected in the cycle of learning and improvement.</li>
</ul>
</div>
</div>
<div id="outline-container-org2020edb" class="outline-3">
<h3 id="org2020edb"><span class="section-number-3">8.11.</span> Describe the main activities common to all software processes</h3>
<div class="outline-text-3" id="text-8-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Activity</b></td>
<td class="org-left"><b>Purpose</b></td>
</tr>

<tr>
<td class="org-left">--------------</td>
<td class="org-left">--------------------------------</td>
</tr>

<tr>
<td class="org-left">Specification</td>
<td class="org-left">Define what to build</td>
</tr>

<tr>
<td class="org-left">Design</td>
<td class="org-left">Plan how to build it</td>
</tr>

<tr>
<td class="org-left">Implementation</td>
<td class="org-left">Build the software</td>
</tr>

<tr>
<td class="org-left">Testing</td>
<td class="org-left">Verify it works correctly</td>
</tr>

<tr>
<td class="org-left">Deployment</td>
<td class="org-left">Deliver to users</td>
</tr>

<tr>
<td class="org-left">Maintenance</td>
<td class="org-left">Keep software useful and updated</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org56729f3" class="outline-3">
<h3 id="org56729f3"><span class="section-number-3">8.12.</span> What is the software process model or software process description?</h3>
<div class="outline-text-3" id="text-8-12">
<ul class="org-ul">
<li>It is an abstract representation or framework that defines the structure, sequence and flow of activities involved in software development. It describes how:
<ul class="org-ul">
<li>Software is developed, delivered and maintained</li>
<li>Provides a blueprint or guidelines for organising tasks, roles and tools throughout the project</li>
</ul></li>
<li>Some common software process models:
<ul class="org-ul">
<li>Waterfall Model</li>
<li>Agile Model</li>
<li>Spiral Model</li>
<li>V-Model</li>
<li>Incremental Model</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9c45cf4" class="outline-3">
<h3 id="org9c45cf4"><span class="section-number-3">8.13.</span> What is the main difference between plan-driven and agile processes?</h3>
<div class="outline-text-3" id="text-8-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspect</th>
<th scope="col" class="org-left">Plan-Driven Processes</th>
<th scope="col" class="org-left">Agile Processes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Definition</b></b></td>
<td class="org-left">Rely on detailed planning and documentation.</td>
<td class="org-left">Emphasize flexibility and iterative development.</td>
</tr>

<tr>
<td class="org-left"><b><b>Planning</b></b></td>
<td class="org-left">Extensive upfront planning and design.</td>
<td class="org-left">Minimal initial planning; adapt as you go.</td>
</tr>

<tr>
<td class="org-left"><b><b>Change Management</b></b></td>
<td class="org-left">Changes are often difficult and costly to implement.</td>
<td class="org-left">Embrace changes even late in development.</td>
</tr>

<tr>
<td class="org-left"><b><b>Customer Involvement</b></b></td>
<td class="org-left">Limited customer interaction until later stages.</td>
<td class="org-left">Continuous customer collaboration throughout.</td>
</tr>

<tr>
<td class="org-left"><b><b>Development Approach</b></b></td>
<td class="org-left">Sequential phases (e.g., Waterfall).</td>
<td class="org-left">Iterative cycles (sprints) with frequent releases.</td>
</tr>

<tr>
<td class="org-left"><b><b>Documentation</b></b></td>
<td class="org-left">Heavy documentation is required.</td>
<td class="org-left">Less emphasis on documentation; focus on working software.</td>
</tr>

<tr>
<td class="org-left"><b><b>Risk Management</b></b></td>
<td class="org-left">Risks are identified and planned for upfront.</td>
<td class="org-left">Risks are managed through iterative feedback and adaptation.</td>
</tr>

<tr>
<td class="org-left"><b><b>Team Structure</b></b></td>
<td class="org-left">Often hierarchical with defined roles.</td>
<td class="org-left">Cross-functional teams with shared responsibilities.</td>
</tr>

<tr>
<td class="org-left"><b><b>Success Metrics</b></b></td>
<td class="org-left">Success measured by adherence to the plan and documentation.</td>
<td class="org-left">Success measured by customer satisfaction and working software.</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org718d3be" class="outline-4">
<h4 id="org718d3be">Key Takeaways</h4>
<div class="outline-text-4" id="text-org718d3be">
<ul class="org-ul">
<li><b><b>Plan-Driven Processes</b></b>: These processes are characterized by a structured approach, where detailed planning and documentation are crucial. They are best suited for projects with well-defined requirements and low uncertainty.</li>

<li><b><b>Agile Processes</b></b>: Agile methodologies prioritize adaptability and customer collaboration. They are ideal for projects where requirements may evolve, allowing teams to respond quickly to changes and deliver value incrementally.</li>
</ul>

<p>
Understanding these differences helps teams choose the right approach based on project needs, stakeholder expectations, and the level of uncertainty involved.
</p>
</div>
</div>
</div>
