notes/cse/software-design-and-testing.html
<div id="outline-container-org39e6c99" class="outline-3">
<h3 id="org39e6c99"><span class="section-number-3">8.14.</span> Describe the waterfall model in software development and discuss some of the inherent problems in the waterfall model</h3>
<div class="outline-text-3" id="text-8-14">
<p>
The Waterfall Model is one of the earliest and most straightforward software development methodologies. It follows a linear and sequential approach, where each phase must be completed before moving on to the next. The typical phases of the Waterfall Model include:
</p>

<ul class="org-ul">
<li><b>Requirements Analysis</b>: Gathering and documenting all the software requirements from stakeholders.</li>
<li><b>System Design</b>: Creating the architecture and design specifications based on the requirements.</li>
<li><b>Implementation</b>: Writing the actual code and developing the software.</li>
<li><b>Verification (Testing)</b>: Testing the software to ensure it meets the specified requirements.</li>
<li><b>Maintenance</b>: Addressing any issues or updates needed after deployment.</li>
</ul>
</div>
<div id="outline-container-org266eab8" class="outline-4">
<h4 id="org266eab8">Inherent Problems in the Waterfall Model</h4>
<div class="outline-text-4" id="text-org266eab8">
<p>
While the Waterfall Model has its advantages, such as simplicity and clear milestones, it also has several inherent problems:
</p>

<ul class="org-ul">
<li>Inflexibility to Changes: Once a phase is completed, going back to make changes is often difficult and costly. This rigidity can lead to issues if requirements evolve during the development process.</li>
<li>Late Testing: Testing occurs only after implementation, which means that defects may not be discovered until late in the project. This can result in significant rework and delays.</li>
<li>Assumption of Clear Requirements: The model assumes that all requirements can be gathered upfront and that they will remain stable throughout the project. In reality, requirements often change as stakeholders gain a better understanding of their needs.</li>
<li>Limited Customer Involvement: Customer feedback is typically sought only at the beginning and end of the process. This can lead to a final product that does not fully meet user expectations.</li>
<li>Risk of Project Overruns: Due to its sequential nature, any delays in one phase can cascade through the project, leading to missed deadlines and budget overruns.</li>
<li>Difficulty in Managing Complex Projects: For large and complex projects, the Waterfall Model can become unwieldy, making it challenging to manage dependencies and integration between different components.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1f609c2" class="outline-3">
<h3 id="org1f609c2"><span class="section-number-3">8.15.</span> Discuss advantages and disadvantages of story cards</h3>
<div class="outline-text-3" id="text-8-15">
</div>
<div id="outline-container-org8b0b9fb" class="outline-4">
<h4 id="org8b0b9fb">Advantages</h4>
<div class="outline-text-4" id="text-org8b0b9fb">
<ul class="org-ul">
<li>User-Centric Focus: Story cards emphasize the needs and experiences of the end user, ensuring that development efforts align with user value.</li>
<li>Simplicity and Clarity: They provide a straightforward way to capture requirements, making it easier for team members to understand what needs to be done without getting bogged down in technical details.</li>
<li>Facilitates Communication: Story cards encourage discussions among team members and stakeholders, fostering collaboration and shared understanding of project goals.</li>
<li>Prioritization: They can be easily prioritized based on user needs, business value, or project goals, helping teams focus on delivering the most important features first.</li>
<li>Flexibility: Story cards can be easily modified or added as new requirements emerge, allowing teams to adapt to changing circumstances and feedback.</li>
<li>Visual Management: When used on boards (like Kanban boards), story cards provide a visual representation of work in progress, helping teams track progress and identify bottlenecks.</li>
</ul>
</div>
</div>
<div id="outline-container-org492969d" class="outline-4">
<h4 id="org492969d">Disadvantages</h4>
<div class="outline-text-4" id="text-org492969d">
<ul class="org-ul">
<li>Over-Simplification: While simplicity is an advantage, it can also lead to oversimplification of complex requirements, potentially missing critical details that need to be addressed.</li>
<li>Lack of Formal Documentation: Story cards may not provide enough formal documentation for future reference, which can be problematic for onboarding new team members or for long-term maintenance.</li>
<li>Dependency Management: Managing dependencies between story cards can be challenging, especially if they are not clearly defined, leading to integration issues later in the development process.</li>
<li>Variable Interpretation: Different team members may interpret story cards differently, leading to inconsistencies in understanding and implementation.</li>
<li>Potential for Scope Creep: The flexibility of story cards can sometimes lead to scope creep, where additional features or requirements are added without proper evaluation of their impact on the project.</li>
<li>Time-Consuming: Creating and refining story cards can be time-consuming, especially if there are many stakeholders involved, which may slow down the initial phases of development.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc9a2aa4" class="outline-3">
<h3 id="orgc9a2aa4"><span class="section-number-3">8.16.</span> What are the three parts of a user story. Give examples of a User Story Description. Describe how user story should follow the INVEST principle giving examples to support your answer.</h3>
<div class="outline-text-3" id="text-8-16">
<ul class="org-ul">
<li>The three parts of a user story are: <b>As a</b>, <b>I want</b>, <b>So that</b> (aka The Role, The Goal, The Reason or the who/what/why)</li>
<li>The INVEST principle is a guideline for creating effective user stories. It stands for:
<ul class="org-ul">
<li>Independent: User stories should be self-contained and not dependent on other stories.</li>
<li>Negotiable: User stories should be flexible and open to discussion and changes.</li>
<li>Valuable: Each user story should deliver value to the user or customer.</li>
<li>Estimable: User stories should be clear enough to allow for estimation of the effort required to complete them.</li>
<li>Small: User stories should be small enough to be completed within a single iteration or sprint.</li>
<li>Testable: User stories should have clear acceptance criteria that allow for testing.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgbdc1b29" class="outline-4">
<h4 id="orgbdc1b29">Examples supporting the INVEST principle</h4>
<div class="outline-text-4" id="text-orgbdc1b29">
<p class="verse">
Independent:<br />
Good Example: "As a user, I want to reset my password so that I can regain access to my account."<br />
Bad Example: "As a user, I want to reset my password and also change my email address." (These are dependent tasks.)<br />
<br />
Negotiable:<br />
Good Example: "As a user, I want to filter search results by price range." (This can be discussed and refined.)<br />
Bad Example: "As a user, I want the filter to be exactly $10 to $50." (This is too rigid and specific.)<br />
<br />
Valuable:<br />
Good Example: "As a user, I want to save my favorite items so that I can easily find them later." (This provides clear value.)<br />
Bad Example: "As a user, I want the system to have a blue background." (This does not provide significant value.)<br />
<br />
Estimable:<br />
Good Example: "As a user, I want to view my order history so that I can track my purchases." (This is clear and can be estimated.)<br />
Bad Example: "As a user, I want to improve the performance of the application." (This is vague and hard to estimate.)<br />
<br />
Small:<br />
Good Example: "As a user, I want to add items to my shopping cart." (This is a small, manageable task.)<br />
Bad Example: "As a user, I want to build a complete e-commerce platform." (This is too large and complex.)<br />
<br />
Testable:<br />
Good Example: "As a user, I want to receive a confirmation email after placing an order." (This can be tested with clear criteria.)<br />
Bad Example: "As a user, I want the application to be user-friendly." (This is subjective and lacks clear testing criteria.)<br />
</p>
</div>
</div>
</div>
