notes/cse/software-design-and-testing.html
<div id="outline-container-org0d0cc4c" class="outline-3">
<h3 id="org0d0cc4c"><span class="section-number-3">8.17.</span> With respect to User Stories what is the definition of done. Give examples.</h3>
<div class="outline-text-3" id="text-8-17">
<ul class="org-ul">
<li>The Definition of Done (DoD) is a clear and concise checklist that outlines the criteria that must be met for a user story to be considered complete.</li>
<li>Examples:</li>
<li>Code Completion:
<ul class="org-ul">
<li>The code for the user story has been written and adheres to coding standards.</li>
</ul></li>
<li>Code Review:
<ul class="org-ul">
<li>The code has been reviewed by at least one other team member and all feedback has been addressed.</li>
</ul></li>
<li>Testing:
<ul class="org-ul">
<li>Unit tests have been written and passed.</li>
<li>Integration tests have been conducted, and the feature works as expected.</li>
<li>User acceptance testing (UAT) has been completed with stakeholder approval.</li>
</ul></li>
<li>Documentation:
<ul class="org-ul">
<li>Relevant documentation has been updated, including user manuals, API documentation, and internal wikis.</li>
</ul></li>
<li>Deployment:
<ul class="org-ul">
<li>The feature has been deployed to the staging environment and verified.</li>
<li>The feature is ready for production deployment.</li>
</ul></li>
<li>Performance:
<ul class="org-ul">
<li>The feature meets performance benchmarks and does not degrade the application's overall performance.</li>
</ul></li>
<li>Security:
<ul class="org-ul">
<li>Security checks have been performed, and any vulnerabilities have been addressed.</li>
</ul></li>
<li>Compliance:
<ul class="org-ul">
<li>The feature complies with relevant regulations and standards (e.g., GDPR, accessibility).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbbede28" class="outline-3">
<h3 id="orgbbede28"><span class="section-number-3">8.18.</span> Cone of uncertainty</h3>
<div class="outline-text-3" id="text-8-18">
<ul class="org-ul">
<li>The less of an epic a story is the better it can be estimated, basically&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org3402114" class="outline-3">
<h3 id="org3402114"><span class="section-number-3">8.19.</span> What are “functional” requirements in software development?</h3>
<div class="outline-text-3" id="text-8-19">
<ul class="org-ul">
<li>Functional requirements are specific statements that define the behavior, capabilities, and functionalities of a software system. They describe what the system should do, outlining the expected interactions between the system and its users, as well as the system's responses to various inputs. Functional requirements are essential for guiding the development process and ensuring that the final product meets user needs and expectations.</li>
<li>Key characteristics: user-centric, specific and clear, testable, traceable</li>
<li>Examples:</li>
<li>User Authentication:
<ul class="org-ul">
<li>The system shall allow users to register with a username and password.</li>
<li>The system shall provide a "Forgot Password" feature to reset passwords via email.</li>
</ul></li>
<li>Data Management:
<ul class="org-ul">
<li>The system shall allow users to create, read, update, and delete (CRUD) records in the database.</li>
<li>The system shall validate user input to ensure data integrity.</li>
</ul></li>
<li>Reporting:
<ul class="org-ul">
<li>The system shall generate monthly sales reports in PDF format.</li>
<li>The system shall allow users to filter reports by date range and product category.</li>
</ul></li>
<li>Search Functionality:
<ul class="org-ul">
<li>The system shall provide a search feature that allows users to find products by name, category, or price range.</li>
<li>The system shall display search results within 2 seconds of submitting a query.</li>
</ul></li>
<li>Notifications:
<ul class="org-ul">
<li>The system shall send email notifications to users when their orders are shipped.</li>
<li>The system shall display in-app notifications for important updates.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge3cfe70" class="outline-3">
<h3 id="orge3cfe70"><span class="section-number-3">8.20.</span> What is a “non-functional” requirement in software development? Provide examples as well</h3>
<div class="outline-text-3" id="text-8-20">
<ul class="org-ul">
<li>Non-functional requirements (NFRs) specify the criteria that judge the operation of a system, rather than the specific behaviors or functions it performs. They define how a system should behave and outline the quality attributes, constraints and performance metrics that the system must meet.</li>
<li>Key characteristics (<b>classifications</b>): Quality attributes (performance, security, usability, etc.), system constraints (impose constraints on the system), measurable (should be quantifiable), broad scope (generally apply to the whole system)</li>
<li>Examples:</li>
<li>Performance:
<ul class="org-ul">
<li>The system shall handle 1,000 concurrent users without performance degradation.</li>
<li>The system shall respond to user requests within 2 seconds under normal load conditions.</li>
</ul></li>
<li>Scalability:
<ul class="org-ul">
<li>The system shall be able to scale horizontally to accommodate an increase in user traffic by 50% without requiring significant reconfiguration.</li>
</ul></li>
<li>Security:
<ul class="org-ul">
<li>The system shall encrypt all sensitive user data both in transit and at rest.</li>
<li>The system shall implement role-based access control to restrict user permissions based on their roles.</li>
</ul></li>
<li>Usability:
<ul class="org-ul">
<li>The system shall allow users to complete the registration process within 5 minutes.</li>
<li>The system shall provide an intuitive user interface that requires no more than three clicks to access any feature.</li>
</ul></li>
<li>Reliability:
<ul class="org-ul">
<li>The system shall have an uptime of 99.9% over a one-year period.</li>
<li>The system shall automatically recover from failures within 5 minutes.</li>
</ul></li>
<li>Maintainability:
<ul class="org-ul">
<li>The system shall allow for updates and patches to be applied without downtime.</li>
<li>The system's codebase shall be documented to facilitate onboarding of new developers.</li>
</ul></li>
<li>Compliance:
<ul class="org-ul">
<li>The system shall comply with GDPR regulations regarding user data privacy and protection.</li>
<li>The system shall meet accessibility standards (e.g., WCAG 2.1) to ensure usability for individuals with disabilities.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2b12301" class="outline-3">
<h3 id="org2b12301"><span class="section-number-3">8.21.</span> Explain Spring Velocity and how it is calculated</h3>
<div class="outline-text-3" id="text-8-21">
<ul class="org-ul">
<li>Velocity is a key metric used in Agile methodologies, particularly in Scrum, to measure the amount of work a team can complete during a single sprint. It helps teams estimate their capacity for future sprints and assess their performance over time. Velocity is typically expressed in terms of story points, which are units of measure for the size or complexity of user stories.</li>
<li>Sprint velocity is calculated by summing the story points of all the user stories that are completed during a sprint.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaba0147" class="outline-3">
<h3 id="orgaba0147"><span class="section-number-3">8.22.</span> What is an Agile Method</h3>
<div class="outline-text-3" id="text-8-22">
<ul class="org-ul">
<li>An Agile method is a flexible and iterative approach to software development that emphasizes collaboration, customer feedback, and rapid delivery of functional software. Agile methodologies prioritize adaptive planning and encourage frequent reassessment and adjustment of plans based on changing requirements and stakeholder input.</li>
</ul>
</div>
</div>
<div id="outline-container-org2880d52" class="outline-3">
<h3 id="org2880d52"><span class="section-number-3">8.23.</span> What does the terms “chickens” and “pigs” relate to with respect to Scrum?</h3>
<div class="outline-text-3" id="text-8-23">
<ul class="org-ul">
<li>Chickens: Refer to individuals who are involved in the project but are not directly responsible for the delivery of the product. They have an interest in the project's outcome but do not have a stake in the day-to-day activities of the Scrum team. Examples: Stakeholders, management, customers</li>
<li>Pigs: refer to the core members of the Scrum team who are fully committed to the project and responsible for delivering the product increment. They are directly involved in the work and have a stake in the success of the project. Examples: PO, Scrum Master, Dev Team</li>
</ul>
</div>
</div>
<div id="outline-container-org51d1ce4" class="outline-3">
<h3 id="org51d1ce4"><span class="section-number-3">8.24.</span> Describe in detail the Scrum lifecycle and outline the roles, ceremonies and artifacts involved in the Scrum methodology</h3>
</div>
