notes/cse/software-design-and-testing.org
** What is Maven in Java?
   - Maven is a powerful build automation and project management tool primarily used for Java projects. It simplifies the process of managing project dependencies, building applications, and maintaining project structures. Maven is part of the Apache Software Foundation and follows a convention-over-configuration approach, which means it provides a standard way to structure projects and manage their lifecycle.

** Some common Maven goals:
   - mvn compile: Compiles the source code of the project.
   - mvn test: Runs the unit tests using a testing framework (e.g., JUnit).
   - mvn package: Packages the compiled code into a distributable format, such as a JAR or WAR file.
   - mvn install: Installs the packaged artifact into the local Maven repository, making it available for other projects.
   - mvn clean: Cleans the project by removing the target directory, which contains compiled code and packaged artifacts.

** What is static testing?
   - Static testing is a software testing technique that involves examining the code, documentation, and other project artifacts without executing the program.

** In software development Describe the fundamental test process using a diagram.
   - The fundamental test process in software development typically consists of several key stages. Below is a diagram that outlines these stages, followed by a detailed description of each phase.
   #+begin_verse
+-------------------+
|   Test Planning   |
+-------------------+
          |
          v
+-------------------+
|  Test Design      |
+-------------------+
          |
          v
+-------------------+
|  Test Execution    |
+-------------------+
          |
          v
+-------------------+
|  Test Closure      |
+-------------------+
   #+end_verse

** Describe the different test levels you might expect to find in a software development project.
   - Unit Testing: Testing the smallest testable parts of the application in isolation.
   - Integration Testing: Ensuring that combined parts of the application work together as expected.
   - System Testing: Testing the application as a whole to ensure it meets specified requirements.
   - Acceptance Testing: Validating the software from the end-user's perspective.
   - Regression Testing: Re-running previously completed tests to confirm that the software still performs as expected.
   - Performance Testing: Evaluating how the system performs under various conditions.
   - Security Testing: Testing the application for security flaws and compliance with security standards.
   - Usability Testing: Ensuring that the software is user-friendly and meets user expectations.

* Remove at the End
  #+BEGIN_EXPORT html
  <script src="../assets/jquery-3.3.1.min.js"></script>
  <script src="../assets/notes.js"></script>
  #+END_EXPORT
