notes/cse/software-design-and-testing.html

<div id="outline-container-orga9112f5" class="outline-3">
<h3 id="orga9112f5"><span class="section-number-3">8.25.</span> What is Maven in Java?</h3>
<div class="outline-text-3" id="text-8-25">
<ul class="org-ul">
<li>Maven is a powerful build automation and project management tool primarily used for Java projects. It simplifies the process of managing project dependencies, building applications, and maintaining project structures. Maven is part of the Apache Software Foundation and follows a convention-over-configuration approach, which means it provides a standard way to structure projects and manage their lifecycle.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc642ee" class="outline-3">
<h3 id="orgfc642ee"><span class="section-number-3">8.26.</span> Some common Maven goals:</h3>
<div class="outline-text-3" id="text-8-26">
<ul class="org-ul">
<li>mvn compile: Compiles the source code of the project.</li>
<li>mvn test: Runs the unit tests using a testing framework (e.g., JUnit).</li>
<li>mvn package: Packages the compiled code into a distributable format, such as a JAR or WAR file.</li>
<li>mvn install: Installs the packaged artifact into the local Maven repository, making it available for other projects.</li>
<li>mvn clean: Cleans the project by removing the target directory, which contains compiled code and packaged artifacts.</li>
</ul>
</div>
</div>
<div id="outline-container-org12ded8a" class="outline-3">
<h3 id="org12ded8a"><span class="section-number-3">8.27.</span> What is static testing?</h3>
<div class="outline-text-3" id="text-8-27">
<ul class="org-ul">
<li>Static testing is a software testing technique that involves examining the code, documentation, and other project artifacts without executing the program.</li>
</ul>
</div>
</div>
<div id="outline-container-orgce88aac" class="outline-3">
<h3 id="orgce88aac"><span class="section-number-3">8.28.</span> In software development Describe the fundamental test process using a diagram.</h3>
<div class="outline-text-3" id="text-8-28">
<ul class="org-ul">
<li>The fundamental test process in software development typically consists of several key stages. Below is a diagram that outlines these stages, followed by a detailed description of each phase.</li>
</ul>
<p class="verse">
<del>-------------------</del><br />
|   Test Planning   |<br />
<del>-------------------</del><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;v<br />
<del>-------------------</del><br />
|  Test Design      |<br />
<del>-------------------</del><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;v<br />
<del>-------------------</del><br />
|  Test Execution    |<br />
<del>-------------------</del><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;|<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;v<br />
<del>-------------------</del><br />
|  Test Closure      |<br />
<del>-------------------</del><br />
</p>
</div>
</div>
<div id="outline-container-orgf271a02" class="outline-3">
<h3 id="orgf271a02"><span class="section-number-3">8.29.</span> Describe the different test levels you might expect to find in a software development project.</h3>
<div class="outline-text-3" id="text-8-29">
<ul class="org-ul">
<li>Unit Testing: Testing the smallest testable parts of the application in isolation.</li>
<li>Integration Testing: Ensuring that combined parts of the application work together as expected.</li>
<li>System Testing: Testing the application as a whole to ensure it meets specified requirements.</li>
<li>Acceptance Testing: Validating the software from the end-user's perspective.</li>
<li>Regression Testing: Re-running previously completed tests to confirm that the software still performs as expected.</li>
<li>Performance Testing: Evaluating how the system performs under various conditions.</li>
<li>Security Testing: Testing the application for security flaws and compliance with security standards.</li>
<li>Usability Testing: Ensuring that the software is user-friendly and meets user expectations.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8932aba" class="outline-2">
<h2 id="org8932aba"><span class="section-number-2">9.</span> Remove at the End</h2>
<div class="outline-text-2" id="text-9">
<script src="../assets/jquery-3.3.1.min.js"></script>
<script src="../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-06-25 Wed 09:00</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2025-07-30 Wed 09:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
